<h1 align = center> SQL Views </h1>
<h4 align = center> Facilitator: Kelvin Oyanna</h4>
<h4 align = center> Email: dotkelplus@gmail.com</h4>

A view is a virtual or temporary table based on the result set of an SQL query. A view can contain all rows of a table or select rows from a table. A view can be used to summarize data from various tables which can be used to generate reports.

In this lesson we will learn how to create and use Views in SQL.

### Load Ipython SQL

In [1]:
%load_ext sql

### Connect to the dvdrental database from the last lesson

In [3]:
# We're connecting to the PostgreSQL database using the PostgreSQL connection string
# The PostgreSQL string is in this format: %sql dialect+driver://username:password@host:port/databaseName

%sql postgresql://chris:admin1234@localhost/dvdrental

## Creating Views
Database views are created using the CREATE VIEW statement. Views can be created from a single table, multiple tables or another view.

Below is the syntax for creating a view:

CREATE VIEW view_name AS
SELECT column1, column2.....
FROM table_name
WHERE [condition];

Let's create a view from an existing table.

Let's get the data of all inactive customers and store in view for subsequent query

In [4]:
%%sql
CREATE VIEW customer_info AS
SELECT first_name, last_name, email, active
FROM customer
WHERE active = 0

 * postgresql://chris:***@localhost/dvdrental
Done.

[]

### Let's query our created View

In [5]:
%%sql
SELECT *
FROM customer_info
LIMIT 10

 * postgresql://chris:***@localhost/dvdrental
10 rows affected.

[('Sandra', 'Martin', 'sandra.martin@sakilacustomer.org', 0),
 ('Judith', 'Cox', 'judith.cox@sakilacustomer.org', 0),
 ('Sheila', 'Wells', 'sheila.wells@sakilacustomer.org', 0),
 ('Erica', 'Matthews', 'erica.matthews@sakilacustomer.org', 0),
 ('Heidi', 'Larson', 'heidi.larson@sakilacustomer.org', 0),
 ('Penny', 'Neal', 'penny.neal@sakilacustomer.org', 0),
 ('Kenneth', 'Gooden', 'kenneth.gooden@sakilacustomer.org', 0),
 ('Harry', 'Arce', 'harry.arce@sakilacustomer.org', 0),
 ('Nathan', 'Runyon', 'nathan.runyon@sakilacustomer.org', 0),
 ('Theodore', 'Culp', 'theodore.culp@sakilacustomer.org', 0)]

## The With Check Option
The With Check Option is a CREATE VIEW statement option used to ensure that all UPDATE and INSERTs into the created View satisfies the condition(s) in the view definition. If they do not satisfy the condition(s), the UPDATE or INSERT returns an error.

Let's see an example of this:

In [6]:
%%sql
CREATE VIEW customer_bio AS
SELECT customer_id, first_name, last_name, email
FROM customer
WHERE email IS NOT NULL
WITH CHECK OPTION

 * postgresql://chris:***@localhost/dvdrental
Done.

[]

In [7]:
%%sql
select * from customer_bio
limit 5

 * postgresql://chris:***@localhost/dvdrental
5 rows affected.

[(524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org'),
 (1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org'),
 (2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org'),
 (3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org'),
 (4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org')]

<b> On update of the customer_bio view created above with a NULL value, we get an error as the check option will be violated.</b>

In [9]:
%%sql
UPDATE customer_bio
SET email = NULL
WHERE customer_id = 524

SyntaxError: invalid syntax (369167683.py, line 2)

<b>An Update on done on the view is automatically updated on the parent table</b>

In [10]:
%%sql
UPDATE customer_bio
SET email = 'mary@gmail.com'
WHERE customer_id = 1

 * postgresql://chris:***@localhost/dvdrental
1 rows affected.

[]

In [11]:
%%sql
select * from customer
where customer_id = 1
limit 5

 * postgresql://chris:***@localhost/dvdrental
1 rows affected.

[(1, 1, 'Mary', 'Smith', 'mary@gmail.com', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2023, 9, 15, 22, 48, 35, 682516), 1)]